"""
行程规划（DeepSeek）
==============

演示推理 Cookbook 示例。
"""

from agno.agent import Agent
from agno.models.deepseek import DeepSeek
from agno.models.openai import OpenAIChat


# ---------------------------------------------------------------------------
# 创建示例
# ---------------------------------------------------------------------------
def run_example() -> None:
    # ---------------------------------------------------------------------------
    # 创建 Agent
    # ---------------------------------------------------------------------------
    task = "请规划一份从洛杉矶到拉斯维加斯的行程"

    reasoning_agent = Agent(
        model=OpenAIChat(id="gpt-4o"),
        reasoning_model=DeepSeek(id="deepseek-reasoner"),
        markdown=True,
    )

    # ---------------------------------------------------------------------------
    # 运行 Agent
    # ---------------------------------------------------------------------------
    if __name__ == "__main__":
        reasoning_agent.print_response(task, stream=True)


# ---------------------------------------------------------------------------
# 运行示例
# ---------------------------------------------------------------------------
if __name__ == "__main__":
    run_example()
